<template>
  <q-page class="page ">
    <section class="about-wrapper">
      <div class="container">
        <q-breadcrumbs class="breadcrumbs">
          <q-breadcrumbs-el class="text-grey-6" :to="{name:'index'}" label="Главная" />

          <q-breadcrumbs-el label="О нас" />
        </q-breadcrumbs>

        <h1 class="title q-mb-lg q-mb-lg-xl">О нас</h1>
        <div class="row q-col-gutter-md-xl">
          <div class=" col-12 col-md-9 col-lg-7">
            <p class="q-mb-none text-lh-200">
              Наша Команда специалистов в области искусства, менеджмента и маркетинга, в партнерстве с китайской компанией ArtBooklet LTD.<br>( <a target="_blank" class="link text-bold" href="doc1.jpg">лицензия</a> ), предлагает Вам абсолютно новый подход к продажам предметов искусства.  <br><br>

              Вся наша деятельность нацелена на то, чтобы предметы искусства приносили своему владельцу не только эстетическое удовольствие, но и материальную выгоду.
              Гораздо приятней смотреть на картину и знать, что деньги, потраченные на ее приобретение, не только возможно вернуть, но и приумножить.
              <br><br>
              Не важно, что вы будете делать с картиной, повесите дома, в офисе, подарите друзьям, или оставите у нас на хранение, вы всегда будете получать с нее доход.
            </p>
          </div>
<!--          <img  class="img lt-sm" src="~assets/a_bg_mob.png" alt="">-->
          <img  class="img about-img-med q-mt-lg" src="~assets/a_bg_med.png" alt="">

          <img  class="img about-img-mob q-mt-lg" src="~assets/a_bg_mob.png" alt="">
        </div>
      </div>
    </section>

    <section class="interier">
      <div style="margin-bottom: 35px" class="container">
        <p class="text-dark text-fs18 text-bold q-mb-lg">Галерея в Ханчжоу (泉州) </p>
        <div class="row">
           <p class="q-mb-lg text-lh-200 col-12 col-md-9">
          Artdox при поддержке китайской компании ArtBooklet Ltd,  начали свою экспозиционную деятельность в городе Ханчджоу — центре академического искусства Китая. На выставочных площадках города разместили свою первую экспозицию, посвященную флоре и фауне Южной Америки.
        </p>
        </div>

        <p class="q-mb-lg"><a target="_blank" class="link" href="https://en.caa.edu.cn/about/intro/index.html">Сайт академических искусств</a></p>
        <div style="margin-bottom: 25px" class="interier-grid">
          <div @click="modalImg = 'about' + (index+1) + '.png',modal=true" class="overlay-img" v-for="(i,index) in 3" :key="i">
            <img class="img" :src="`about${index+1}.png`" alt="">
            <div class="overlay-img__overlay">
              <svg width="21" height="21" viewBox="0 0 21 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M13.9999 8.9999H10.9999V5.9999C10.9999 5.73469 10.8945 5.48033 10.707 5.2928C10.5195 5.10526 10.2651 4.9999 9.9999 4.9999C9.73469 4.9999 9.48033 5.10526 9.2928 5.2928C9.10526 5.48033 8.9999 5.73469 8.9999 5.9999V8.9999H5.9999C5.73469 8.9999 5.48033 9.10526 5.2928 9.2928C5.10526 9.48033 4.9999 9.73469 4.9999 9.9999C4.9999 10.2651 5.10526 10.5195 5.2928 10.707C5.48033 10.8945 5.73469 10.9999 5.9999 10.9999H8.9999V13.9999C8.9999 14.2651 9.10526 14.5195 9.2928 14.707C9.48033 14.8945 9.73469 14.9999 9.9999 14.9999C10.2651 14.9999 10.5195 14.8945 10.707 14.707C10.8945 14.5195 10.9999 14.2651 10.9999 13.9999V10.9999H13.9999C14.2651 10.9999 14.5195 10.8945 14.707 10.707C14.8945 10.5195 14.9999 10.2651 14.9999 9.9999C14.9999 9.73469 14.8945 9.48033 14.707 9.2928C14.5195 9.10526 14.2651 8.9999 13.9999 8.9999ZM20.7099 19.2899L16.9999 15.6099C18.44 13.8143 19.1374 11.5352 18.9487 9.2412C18.76 6.94721 17.6996 4.81269 15.9854 3.27655C14.2713 1.74041 12.0337 0.919414 9.73283 0.982375C7.43194 1.04534 5.24263 1.98747 3.61505 3.61505C1.98747 5.24263 1.04534 7.43194 0.982375 9.73283C0.919414 12.0337 1.74041 14.2713 3.27655 15.9854C4.81269 17.6996 6.94721 18.76 9.2412 18.9487C11.5352 19.1374 13.8143 18.44 15.6099 16.9999L19.2899 20.6799C19.3829 20.7736 19.4935 20.848 19.6153 20.8988C19.7372 20.9496 19.8679 20.9757 19.9999 20.9757C20.1319 20.9757 20.2626 20.9496 20.3845 20.8988C20.5063 20.848 20.6169 20.7736 20.7099 20.6799C20.8901 20.4934 20.9909 20.2442 20.9909 19.9849C20.9909 19.7256 20.8901 19.4764 20.7099 19.2899ZM9.9999 16.9999C8.61544 16.9999 7.26206 16.5894 6.11091 15.8202C4.95977 15.051 4.06256 13.9578 3.53275 12.6787C3.00293 11.3996 2.86431 9.99214 3.13441 8.63427C3.4045 7.27641 4.07119 6.02912 5.05016 5.05016C6.02912 4.07119 7.27641 3.4045 8.63427 3.13441C9.99214 2.86431 11.3996 3.00293 12.6787 3.53275C13.9578 4.06256 15.051 4.95977 15.8202 6.11091C16.5894 7.26206 16.9999 8.61544 16.9999 9.9999C16.9999 11.8564 16.2624 13.6369 14.9497 14.9497C13.6369 16.2624 11.8564 16.9999 9.9999 16.9999Z" fill="white"/>
              </svg>

            </div>
          </div>
        </div>

<!--        <a target="_blank" class="link q-mr-md" href="VID1.mp4">Видео из галереи 1</a>-->
<!--        <a target="_blank" class="link" href="VID2.mp4">Видео из галереи 2</a>-->

<!--                <div class="text-center">-->
<!--                  <q-btn size="18px" class="text-montserrat q-px-xl" no-caps rounded unelevated color="dark" text-color="white" label="Загрузить ещё"/>-->
<!--                </div>-->
      </div>
<!-- <div class="container">-->
<!--        <p class="text-dark text-fs18 text-bold q-mb-lg">Галерея в Шанту (汕头) </p>-->
<!--   <div class="row">-->
<!--         <p class="q-mb-lg text-lh-200 col-12 col-md-9">-->
<!--         Следующая открытая выставка с участием наших картин в городе Шанту, известной китайской провинции с изумительной культурной историей и-->
<!--          великим множеством известных китайских художников. </p>-->
<!--   </div>-->


<!--        <div class="interier-grid">-->
<!--          <div @click="modalImg = 'about' + (index+1) + '.png',modal=true" class="overlay-img" v-for="(i,index) in 3" :key="i">-->
<!--            <img class="img" :src="`about${index+1}.png`" alt="">-->
<!--            <div class="overlay-img__overlay">-->
<!--              <svg width="21" height="21" viewBox="0 0 21 21" fill="none" xmlns="http://www.w3.org/2000/svg">-->
<!--                <path d="M13.9999 8.9999H10.9999V5.9999C10.9999 5.73469 10.8945 5.48033 10.707 5.2928C10.5195 5.10526 10.2651 4.9999 9.9999 4.9999C9.73469 4.9999 9.48033 5.10526 9.2928 5.2928C9.10526 5.48033 8.9999 5.73469 8.9999 5.9999V8.9999H5.9999C5.73469 8.9999 5.48033 9.10526 5.2928 9.2928C5.10526 9.48033 4.9999 9.73469 4.9999 9.9999C4.9999 10.2651 5.10526 10.5195 5.2928 10.707C5.48033 10.8945 5.73469 10.9999 5.9999 10.9999H8.9999V13.9999C8.9999 14.2651 9.10526 14.5195 9.2928 14.707C9.48033 14.8945 9.73469 14.9999 9.9999 14.9999C10.2651 14.9999 10.5195 14.8945 10.707 14.707C10.8945 14.5195 10.9999 14.2651 10.9999 13.9999V10.9999H13.9999C14.2651 10.9999 14.5195 10.8945 14.707 10.707C14.8945 10.5195 14.9999 10.2651 14.9999 9.9999C14.9999 9.73469 14.8945 9.48033 14.707 9.2928C14.5195 9.10526 14.2651 8.9999 13.9999 8.9999ZM20.7099 19.2899L16.9999 15.6099C18.44 13.8143 19.1374 11.5352 18.9487 9.2412C18.76 6.94721 17.6996 4.81269 15.9854 3.27655C14.2713 1.74041 12.0337 0.919414 9.73283 0.982375C7.43194 1.04534 5.24263 1.98747 3.61505 3.61505C1.98747 5.24263 1.04534 7.43194 0.982375 9.73283C0.919414 12.0337 1.74041 14.2713 3.27655 15.9854C4.81269 17.6996 6.94721 18.76 9.2412 18.9487C11.5352 19.1374 13.8143 18.44 15.6099 16.9999L19.2899 20.6799C19.3829 20.7736 19.4935 20.848 19.6153 20.8988C19.7372 20.9496 19.8679 20.9757 19.9999 20.9757C20.1319 20.9757 20.2626 20.9496 20.3845 20.8988C20.5063 20.848 20.6169 20.7736 20.7099 20.6799C20.8901 20.4934 20.9909 20.2442 20.9909 19.9849C20.9909 19.7256 20.8901 19.4764 20.7099 19.2899ZM9.9999 16.9999C8.61544 16.9999 7.26206 16.5894 6.11091 15.8202C4.95977 15.051 4.06256 13.9578 3.53275 12.6787C3.00293 11.3996 2.86431 9.99214 3.13441 8.63427C3.4045 7.27641 4.07119 6.02912 5.05016 5.05016C6.02912 4.07119 7.27641 3.4045 8.63427 3.13441C9.99214 2.86431 11.3996 3.00293 12.6787 3.53275C13.9578 4.06256 15.051 4.95977 15.8202 6.11091C16.5894 7.26206 16.9999 8.61544 16.9999 9.9999C16.9999 11.8564 16.2624 13.6369 14.9497 14.9497C13.6369 16.2624 11.8564 16.9999 9.9999 16.9999Z" fill="white"/>-->
<!--              </svg>-->

<!--            </div>-->
<!--          </div>-->
<!--        </div>-->
<!--                <div class="text-center">-->
<!--                  <q-btn size="18px" class="text-montserrat q-px-xl" no-caps rounded unelevated color="dark" text-color="white" label="Загрузить ещё"/>-->
<!--                </div>-->
<!--      </div>-->
    </section>
     <section  class="about q-pt-xl">
      <div class="container">
        <h3 class="title q-mb-lg ">Как мы работаем</h3>

        <div class="row q-col-gutter-md-xl ">
          <div class=" col-12 col-md-9">
            <p class="q-mb-lg q-mb-md-xl text-lh-200 ">

Каждая картина, купленная у нас на сайте, имеет доходность 30% в год для своего владельца, каждый месяц вы получите 2,5% от суммы, потраченной на покупку. Договор можно пролонгировать каждый год, в течение 5-ти лет. Возврат картины возможен в любое время.


            </p>

          </div>
          <div class="col-12 text-center">
            <img class="img gt-sm" src="~assets/a_img.png" alt="">
            <img class="img lt-md" src="~assets/a_img_mob.png" alt="">
          </div>
        </div>

      </div>
    </section>
    <section class="docs">
      <div class="container">
        <h3 class="title">Документы</h3>
        <div class="row q-gutter-md-xl">
          <div class="col-12 col-md-7 docs-grid q-mb-lg q-mb-lg-none">

            <div >
              <div class="overlay-img " @click="modalImg = `/doc2.jpg`,modal=true">
                <img class="img" src="/doc2.jpg" alt="">
                <div class="overlay-img__overlay">
                  <svg width="21" height="21" viewBox="0 0 21 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M13.9999 8.9999H10.9999V5.9999C10.9999 5.73469 10.8945 5.48033 10.707 5.2928C10.5195 5.10526 10.2651 4.9999 9.9999 4.9999C9.73469 4.9999 9.48033 5.10526 9.2928 5.2928C9.10526 5.48033 8.9999 5.73469 8.9999 5.9999V8.9999H5.9999C5.73469 8.9999 5.48033 9.10526 5.2928 9.2928C5.10526 9.48033 4.9999 9.73469 4.9999 9.9999C4.9999 10.2651 5.10526 10.5195 5.2928 10.707C5.48033 10.8945 5.73469 10.9999 5.9999 10.9999H8.9999V13.9999C8.9999 14.2651 9.10526 14.5195 9.2928 14.707C9.48033 14.8945 9.73469 14.9999 9.9999 14.9999C10.2651 14.9999 10.5195 14.8945 10.707 14.707C10.8945 14.5195 10.9999 14.2651 10.9999 13.9999V10.9999H13.9999C14.2651 10.9999 14.5195 10.8945 14.707 10.707C14.8945 10.5195 14.9999 10.2651 14.9999 9.9999C14.9999 9.73469 14.8945 9.48033 14.707 9.2928C14.5195 9.10526 14.2651 8.9999 13.9999 8.9999ZM20.7099 19.2899L16.9999 15.6099C18.44 13.8143 19.1374 11.5352 18.9487 9.2412C18.76 6.94721 17.6996 4.81269 15.9854 3.27655C14.2713 1.74041 12.0337 0.919414 9.73283 0.982375C7.43194 1.04534 5.24263 1.98747 3.61505 3.61505C1.98747 5.24263 1.04534 7.43194 0.982375 9.73283C0.919414 12.0337 1.74041 14.2713 3.27655 15.9854C4.81269 17.6996 6.94721 18.76 9.2412 18.9487C11.5352 19.1374 13.8143 18.44 15.6099 16.9999L19.2899 20.6799C19.3829 20.7736 19.4935 20.848 19.6153 20.8988C19.7372 20.9496 19.8679 20.9757 19.9999 20.9757C20.1319 20.9757 20.2626 20.9496 20.3845 20.8988C20.5063 20.848 20.6169 20.7736 20.7099 20.6799C20.8901 20.4934 20.9909 20.2442 20.9909 19.9849C20.9909 19.7256 20.8901 19.4764 20.7099 19.2899ZM9.9999 16.9999C8.61544 16.9999 7.26206 16.5894 6.11091 15.8202C4.95977 15.051 4.06256 13.9578 3.53275 12.6787C3.00293 11.3996 2.86431 9.99214 3.13441 8.63427C3.4045 7.27641 4.07119 6.02912 5.05016 5.05016C6.02912 4.07119 7.27641 3.4045 8.63427 3.13441C9.99214 2.86431 11.3996 3.00293 12.6787 3.53275C13.9578 4.06256 15.051 4.95977 15.8202 6.11091C16.5894 7.26206 16.9999 8.61544 16.9999 9.9999C16.9999 11.8564 16.2624 13.6369 14.9497 14.9497C13.6369 16.2624 11.8564 16.9999 9.9999 16.9999Z" fill="white"/>
                  </svg>

                </div>
              </div>
              <p class="no-margin text-caption">Свидетельство о регистрации юридического лица</p>
            </div>
            <div >
              <div class="overlay-img " @click="modalImg = `/doc3.jpg`,modal=true">
                <img class="img" src="/doc3.jpg" alt="">
                <div class="overlay-img__overlay">
                  <svg width="21" height="21" viewBox="0 0 21 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M13.9999 8.9999H10.9999V5.9999C10.9999 5.73469 10.8945 5.48033 10.707 5.2928C10.5195 5.10526 10.2651 4.9999 9.9999 4.9999C9.73469 4.9999 9.48033 5.10526 9.2928 5.2928C9.10526 5.48033 8.9999 5.73469 8.9999 5.9999V8.9999H5.9999C5.73469 8.9999 5.48033 9.10526 5.2928 9.2928C5.10526 9.48033 4.9999 9.73469 4.9999 9.9999C4.9999 10.2651 5.10526 10.5195 5.2928 10.707C5.48033 10.8945 5.73469 10.9999 5.9999 10.9999H8.9999V13.9999C8.9999 14.2651 9.10526 14.5195 9.2928 14.707C9.48033 14.8945 9.73469 14.9999 9.9999 14.9999C10.2651 14.9999 10.5195 14.8945 10.707 14.707C10.8945 14.5195 10.9999 14.2651 10.9999 13.9999V10.9999H13.9999C14.2651 10.9999 14.5195 10.8945 14.707 10.707C14.8945 10.5195 14.9999 10.2651 14.9999 9.9999C14.9999 9.73469 14.8945 9.48033 14.707 9.2928C14.5195 9.10526 14.2651 8.9999 13.9999 8.9999ZM20.7099 19.2899L16.9999 15.6099C18.44 13.8143 19.1374 11.5352 18.9487 9.2412C18.76 6.94721 17.6996 4.81269 15.9854 3.27655C14.2713 1.74041 12.0337 0.919414 9.73283 0.982375C7.43194 1.04534 5.24263 1.98747 3.61505 3.61505C1.98747 5.24263 1.04534 7.43194 0.982375 9.73283C0.919414 12.0337 1.74041 14.2713 3.27655 15.9854C4.81269 17.6996 6.94721 18.76 9.2412 18.9487C11.5352 19.1374 13.8143 18.44 15.6099 16.9999L19.2899 20.6799C19.3829 20.7736 19.4935 20.848 19.6153 20.8988C19.7372 20.9496 19.8679 20.9757 19.9999 20.9757C20.1319 20.9757 20.2626 20.9496 20.3845 20.8988C20.5063 20.848 20.6169 20.7736 20.7099 20.6799C20.8901 20.4934 20.9909 20.2442 20.9909 19.9849C20.9909 19.7256 20.8901 19.4764 20.7099 19.2899ZM9.9999 16.9999C8.61544 16.9999 7.26206 16.5894 6.11091 15.8202C4.95977 15.051 4.06256 13.9578 3.53275 12.6787C3.00293 11.3996 2.86431 9.99214 3.13441 8.63427C3.4045 7.27641 4.07119 6.02912 5.05016 5.05016C6.02912 4.07119 7.27641 3.4045 8.63427 3.13441C9.99214 2.86431 11.3996 3.00293 12.6787 3.53275C13.9578 4.06256 15.051 4.95977 15.8202 6.11091C16.5894 7.26206 16.9999 8.61544 16.9999 9.9999C16.9999 11.8564 16.2624 13.6369 14.9497 14.9497C13.6369 16.2624 11.8564 16.9999 9.9999 16.9999Z" fill="white"/>
                  </svg>

                </div>
              </div>
              <p class="no-margin text-caption">К каждой купленной картине прилагается Сертификат Аутентичности, на котором находится описание изображения, артикул, и информация о хранении картины.</p>
            </div>
            <div >
              <div class="overlay-img " @click="modalImg = `/doc1.jpg`,modal=true">
                <img class="img" src="/doc1.jpg" alt="">
                <div class="overlay-img__overlay">
                  <svg width="21" height="21" viewBox="0 0 21 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M13.9999 8.9999H10.9999V5.9999C10.9999 5.73469 10.8945 5.48033 10.707 5.2928C10.5195 5.10526 10.2651 4.9999 9.9999 4.9999C9.73469 4.9999 9.48033 5.10526 9.2928 5.2928C9.10526 5.48033 8.9999 5.73469 8.9999 5.9999V8.9999H5.9999C5.73469 8.9999 5.48033 9.10526 5.2928 9.2928C5.10526 9.48033 4.9999 9.73469 4.9999 9.9999C4.9999 10.2651 5.10526 10.5195 5.2928 10.707C5.48033 10.8945 5.73469 10.9999 5.9999 10.9999H8.9999V13.9999C8.9999 14.2651 9.10526 14.5195 9.2928 14.707C9.48033 14.8945 9.73469 14.9999 9.9999 14.9999C10.2651 14.9999 10.5195 14.8945 10.707 14.707C10.8945 14.5195 10.9999 14.2651 10.9999 13.9999V10.9999H13.9999C14.2651 10.9999 14.5195 10.8945 14.707 10.707C14.8945 10.5195 14.9999 10.2651 14.9999 9.9999C14.9999 9.73469 14.8945 9.48033 14.707 9.2928C14.5195 9.10526 14.2651 8.9999 13.9999 8.9999ZM20.7099 19.2899L16.9999 15.6099C18.44 13.8143 19.1374 11.5352 18.9487 9.2412C18.76 6.94721 17.6996 4.81269 15.9854 3.27655C14.2713 1.74041 12.0337 0.919414 9.73283 0.982375C7.43194 1.04534 5.24263 1.98747 3.61505 3.61505C1.98747 5.24263 1.04534 7.43194 0.982375 9.73283C0.919414 12.0337 1.74041 14.2713 3.27655 15.9854C4.81269 17.6996 6.94721 18.76 9.2412 18.9487C11.5352 19.1374 13.8143 18.44 15.6099 16.9999L19.2899 20.6799C19.3829 20.7736 19.4935 20.848 19.6153 20.8988C19.7372 20.9496 19.8679 20.9757 19.9999 20.9757C20.1319 20.9757 20.2626 20.9496 20.3845 20.8988C20.5063 20.848 20.6169 20.7736 20.7099 20.6799C20.8901 20.4934 20.9909 20.2442 20.9909 19.9849C20.9909 19.7256 20.8901 19.4764 20.7099 19.2899ZM9.9999 16.9999C8.61544 16.9999 7.26206 16.5894 6.11091 15.8202C4.95977 15.051 4.06256 13.9578 3.53275 12.6787C3.00293 11.3996 2.86431 9.99214 3.13441 8.63427C3.4045 7.27641 4.07119 6.02912 5.05016 5.05016C6.02912 4.07119 7.27641 3.4045 8.63427 3.13441C9.99214 2.86431 11.3996 3.00293 12.6787 3.53275C13.9578 4.06256 15.051 4.95977 15.8202 6.11091C16.5894 7.26206 16.9999 8.61544 16.9999 9.9999C16.9999 11.8564 16.2624 13.6369 14.9497 14.9497C13.6369 16.2624 11.8564 16.9999 9.9999 16.9999Z" fill="white"/>
                  </svg>

                </div>
              </div>
              <p class="no-margin text-caption">Лицензия нашего партнера ArtBooklet</p>
            </div>



          </div>
          <div class="col-12 col-md-4 offer-1 flex column items-start justify-start">
            <p class="q-mb-sm lt-md"><a href="/d-of-ARTDOX.pdf" target="_blank" class="link text-caption">Договор Оферты</a></p>
            <p class="q-mb-sm lt-md"><a href="/d-z.pdf" target="_blank" class="link text-caption">Договор Заклада</a></p>
            <p class="q-mb-sm lt-md"><a href="/d-o-i-u.pdf" target="_blank" class="link text-caption">Договор Хранения</a></p>
            <p class="q-mb-sm lt-md"><a href="/ARTDOX-p-s.pdf" target="_blank" class="link text-caption">Пользовательское соглашение</a></p>
            <p class="q-mb-lg lt-md"><a href="/ARTDOX-conf.pdf" target="_blank" class="link text-caption">Политика Конфиденциальности</a></p>

            <div class="">
              <p class="text-avenir-300 text-lh-200 text-body2">
                Полный список документов, а так же контакты нашей фирмы находятся в разделе Контакты нашего сайта.
              </p>
            </div>
            <div class="q-mt-xl">
              <p class="q-mb-sm gt-sm"><a href="/d-of-ARTDOX.pdf" class="link text-body1">Договор Оферты</a></p>
              <p class="q-mb-sm  gt-sm"><a href="/d-z.pdf" class="link text-body1">Договор Заклада</a></p>
              <p class="q-mb-sm gt-sm"><a href="/d-o-i-u.pdf" class="link text-body1">Договор Хранения</a></p>
              <p class="q-mb-sm gt-sm"><a href="/ARTDOX-p-s.pdf" class="link text-body1">Пользовательское соглашение</a></p>
              <p class="no-margin gt-sm"><a href="/ARTDOX-conf.pdf" class="link text-body1">Политика Конфиденциальности</a></p>
            </div>

          </div>
        </div>
      </div>
    </section>
    <section class="team">
      <div class="container">
        <h3 class="title">Наша команда</h3>
        <div class="team-grid">
          <div class="team-item text-center" v-for="(item,index) in teamItems" :key="index">
            <img class="img" :src="item.img" alt="">
            <p class="text-avenir-450 q-mb-sm text-body2">{{item.name}}</p>
            <p class="text-montserrat text-grey-6 q-mb-none text-body2">{{item.work}}</p>
          </div>
        </div>

      </div>
    </section>





  </q-page>
  <q-dialog
    v-model="modal"
  >
    <q-card class="relative-position" style="width: 1360px; max-width: 90vw; height: auto">
      <q-btn color="white" :dense="$q.screen.lt.sm"  text-color="dark" style="top: 20px; right: 20px" v-close-popup class="absolute-top-right z-max" icon="close" round />
      <img  :src="modalImg">
      <!--      <img  :src="modalImg" alt="">-->
    </q-card>
  </q-dialog>
</template>
<script>

export default {

  data(){
    return{
      modal:false,
      modalImg:'',
      teamItems:[
        {img:'t1.png',name:'Ангелина Коптеева',work:'Искусствовед'},
        {img:'t2.png',name:'Петр Пономарев',work:'Юрист, директор фирмы'},
        {img:'t3.png',name:'Синь Пи Ляо',work:'Менеджер'},


      ]

    }
  }

}
</script>

<style lang="sass" scoped>
.docs-grid
  display: grid
  grid-template-columns: repeat(3,1fr)
  grid-column-gap: 20px
@media (max-width: 1024px)
  .docs-grid
    grid-gap: 10px
.about-img-med
  display: none
.about-img-mob
  display: none
.about-wrapper
  background: url(~assets/a_bg_1920.png) no-repeat left top
  height: 930px
  background-size: contain
  z-index: -1
  margin-top: -40px
  padding-top: 40px
.about-top
  margin-bottom: 375px

.team
  margin-bottom: 45px
  &-grid
    display: grid
    grid-template-columns: repeat(4,1fr)
    grid-gap: 60px
    margin-bottom: 45px
  .team-item
    img
      margin-bottom: 40px
    &:nth-child(even)
      margin-top: 50px
@media (max-width: 1024px)
  .about-img-med
    display: block

  .about-top
    margin-bottom: 0
  .team-grid
    grid-template-columns: repeat(2, 1fr)
    grid-column-gap: 15px
    grid-row-gap: 40px
    .team-item
      img
        margin-bottom: 20px
      &:nth-child(even)
        margin-top: 30px
.interier
  &-grid
    display: grid
    grid-template-columns: repeat(3,1fr)
    grid-column-gap: 20px
    grid-row-gap: 14px
    margin-bottom: 70px
@media (max-width: 1024px)
  .interier-grid
    grid-template-columns: repeat(1, 1fr)
    grid-column-gap: 4px
    grid-row-gap: 0px
@media (max-width: 768px)
  .about-img-med
    display: none
  .about-img-mob
    display: block
@media (max-width: 1365px)
  .about-wrapper
    background: unset
    height: unset

</style>
