<template>
  <q-page class="page">
    <div class="container">
       <q-breadcrumbs class="breadcrumbs">
      <q-breadcrumbs-el class="text-grey-6" :to="{name:'index'}" label="Главная" />

      <q-breadcrumbs-el label="Доходность" />
    </q-breadcrumbs>
        <h1 class="title q-mb-lg q-mb-lg-xl">Доход</h1>
<!--      <p class="text-fs18 text-avenir-600 q-mb-xl">Мы, отработали систему, которая приносит доход от каждой картины.</p>-->
      <p class="text-fs18 text-avenir-450 q-mb-xl">
        Наша работа позволяет сформировать доходность для каждой картины, при этом уровень ликвидности не зависит от художественной ценности и материальной стоимости актива, прибыль с картин получается при условии участия в экспозиционной и продажной деятельности на территории Китая и России.
      </p>
       <h3 class="text-center sub-title">Как <span>мы работаем?</span></h3>
      <div class="profit-wrapper">
        <div class="profit-inner">
          <div class="profit-item" v-for="(item,index) in items" :key="index">
            <div class="">
              <p class="title">0{{index+1}}</p>
              <div class="lt-md"><img class="img" :src="`p${index+1}.png`" alt=""></div>
              <p class="" v-html="item.text"></p>
            </div>
            <div class="gt-sm"><img class="img" :src="`p${index+1}.png`" alt=""></div>
          </div>

        </div>
      </div>
    </div>
  </q-page>
</template>
<script>


export default {
  data() {
    return {
      items:[
        {text:`Для Китая формируем коллекции из 30 авторских репродукций, и через партнера ArtBooklet Ltd., размещаем их на экспозициях в провинциальных городах, с образовательной и просветительской целью. От китайской стороны стабильно получаем 10 Юаней (1,5 $) в сутки за каждую картину, из расчета 300 экспозиционных дней в году. Также открыты пункты продаж репродукций в этих местах. Необходимое количество экспозиций в год не менее 10 (300 картин), и эти потребности в Китае постоянно растут.`},
        {text:`В России сдаем в аренду авторские репродукции музейного качества по 30 рублей в сутки за каждую картину, в общеобразовательные, культурные и административные учреждения, меценаты активно участвуют в этом процессе. `},
        {text:`Мы работаем только с акварельной живописью в Digi Gravure – цифровая гравюра. DIGI – оцифровка оригинала. GRAVURE – оттиск на бумаге. Оборудование – CANON PRO – 6000 (12 – цветный принтер с минеральными пигментами высокой четкости музейного качества. Пигмент- LUCIA PRO – светостойкие. Бумага 310 гр/м2, 100 % хлопок – CANSON. Покрытие спрей лаком LOREAL матовый люкс. Китайским партнерам больше подходит именно этот вариант, так как  они не считают нужным страховать и нести ответственность за оригиналы. Современная, цифровая, типографская техника с поразительной точностью копирует и переносит на бумагу не только цвет, но и фактуру красок, бумаги, холста.`},
        {text:`Все наши картины анонимные, мы заведомо не указываем  авторов, чтобы авторитетом и перечнем заслуг не завышать цены на них. С каждым художником мы имеем соглашение на покупку оцифрованной картины,  на общий тираж произведения (10 штук с каждого оригинала), печать, подпись  и сертификат от художника подтверждает это.           `},
        {text:`Все репродукции картин сделаны на высочайшем уровне, с использованием наилучших, экологически чистых материалов. Наш покупатель получает одну репродукцию, остальные экземпляры отправляются управляющей компанией в разные регионы России и Китая, для обеспечения  дохода.`},
        {text:`Нашей деятельностью мы не только зарабатываем, но и стремимся сделать узнаваемыми картины,  выбранных нами художников.`},
      ]
    }
  }
}
</script>

<style lang="sass" scoped>
.profit
  &-wrapper
    background: #F7F7F9
  &-inner
    max-width: 940px
    margin: 0 auto
  &-item
    display: grid
    grid-template-columns: 2fr 1fr
    align-items: flex-start
    padding: 30px 0
    border-bottom: 1px solid #E5E5E5
    grid-gap: 170px
    &:last-child
      border-bottom: none
@media (max-width: 1024px)
  .profit
    & .text-center
      font-size: 24px
      line-height: 28px
    &-wrapper
      margin: 0 -10px
      padding: 0 10px
    &-item
      grid-template-columns: 1fr
</style>
