<template>
  <q-page style="padding-bottom: 0 !important;" class="page q-pb-none">
    <div class="container">
      <q-breadcrumbs class="breadcrumbs">
        <q-breadcrumbs-el class="text-grey-6" :to="{name:'index'}" label="Главная" />

        <q-breadcrumbs-el label="Доходность" />
      </q-breadcrumbs>
      <h1 class="title q-mb-lg q-mb-lg-xl">Доход</h1>
      <!--      <p class="text-fs18 text-avenir-600 q-mb-xl">Мы, отработали систему, которая приносит доход от каждой картины.</p>-->
      <p class="text-fs18 text-avenir-300 q-mb-xl">
Наша работа позволяет сформировать доходность для каждой картины, при этом уровень ликвидности не зависит от художественной ценности и материальной стоимости актива, прибыль с картин получается при условии участия в экспозиционной и продажной деятельности на территории Китая, а также освоения западных цифровых продажных площадок NFT.</p>
<!--       <div class="row q-mb-xl">-->
<!--        <div class="col-12 col-md-6">-->
<!--          <q-img src="~assets/pp1-1.png"/>-->
<!--        </div>-->
<!--        <div class="col-12 col-md-6">-->
<!--          <q-img src="~assets/pp1-2.png"/>-->
<!--        </div>-->
<!--      </div>-->
<!--      <div class="steps">-->
<!--        <div class="step flex items-center justify-between" v-for="(step,index) in steps" :key="index">-->
<!--          <div class="">-->
<!--            <img :src="step.img" alt="">-->
<!--          </div>-->
<!--          <div style="flex-basis: 65%" class="">-->
<!--            <p class="text-h5 text-avenir-600 q-mb-sm">Шаг {{index+1}}</p>-->
<!--            <p class="no-margin text-avenir-300">{{step.text}}</p>-->
<!--          </div>-->
<!--        </div>-->
<!--      </div>-->
      <div class="q-mb-lg"><span style="opacity: 0">sdfdsf</span></div>
      <div class="row">
        <div class="col-12 col-md-8 text-b">
           <h3 class="title q-mb-lg fs-36">01. Экспозиции картин в Китае</h3>
          <p class="no-margin text-avenir-300">
        Для Китая формируем коллекции из авторских репродукций, и через китайского партнера ArtBooklet Ltd., размещаем их на экспозициях в провинциальных городах, с образовательной и просветительской целью.
<br><br>
От китайской стороны стабильно получаем 10 Юаней (1,5 $) в сутки за каждую картину, из расчета 300 экспозиционных дней в году, там же открыты пункты продаж репродукций. Необходимое количество экспозиций в год не менее 10 (300 картин), и эти потребности в Китае постоянно растут.</p>
        </div>
        <div class="col-12 col-md-3 offset-0 offset-md-1 text-center img-b">
          <img src="/p1.png" alt="">
        </div>
      </div>
      <q-separator style="margin: 50px 0"/>
      <div class="row">
        <div class="col-12 col-md-3 text-center">
          <img src="~assets/nft-img.png" alt="">
        </div>
        <div class="col-12 col-md-7 offset-0 offset-md-2">
          <h3 class="title q-mb-lg fs-36 ">02. Продажа картин NFT – на маркетплейсах OpenSea, Foundation</h3>
          <p class="no-margin text-avenir-300">
         NFT, или "несменяемый токен" - это уникальный цифровой сертификат, который хранится в блокчейне и предоставляет определенные права собственности на актив, такой как цифровое произведение искусства. NFT предоставляют мощный инструмент для установления и демонстрации прав собственности в пространстве цифровых активов. "Чеканка" NFT относится к созданию NFT и его записи в блокчейне впервые. Чеканщик может быть создателем работы, связанной с NFT, например, художником, или кем-либо, имеющим соответствующие права на чеканку NFT цифрового актива.
<br><br>
            ARTDOX - сделала NFT искусство Доходным. Наша цель - заявить о себе на торговых площадках NFT и обеспечить нашим Клиентам достойный заработок. Наш Доход зависит от длительности проведения рекламной кампании, и привязан к курсу криптовалюты ETH (Эфир). Средняя стоимость каждой работы от 0,20 до 0,50 ETH – Etherium (500 – 1300 $)
          </p>
        </div>

      </div>
       <q-separator style="margin: 50px 0"/>
      <div class="row q-mb-xl">
        <div class="col-12 col-md-7 text-b">
          <h3 class="title q-mb-lg fs-36">03. Только проверенные авторы</h3>
          <p class="no-margin text-avenir-300">
         Все наши картины анонимные, мы заведомо не указываем авторов, чтобы авторитетом и перечнем заслуг не завышать цены на них. С каждым художником мы имеем соглашение на покупку оцифрованной картины, на общий тираж произведения (30 штук с каждого оригинала), печать, подпись и сертификат от художника подтверждает это.
<br><br>
Репродукции картин сделаны на высочайшем уровне, с использованием наилучших, экологически чистых материалов. Наш покупатель получает одну репродукцию, остальные экземпляры отправляются управляющей компанией в разные регионы Китая, для обеспечения дохода.
          </p>
        </div>
        <div class="col-12 col-md-3 offset-0 offset-md-1 text-center img-b">
          <img src="/p3.png" alt="">
        </div>
      </div>
       <q-separator style="margin: 50px 0"/>
      <div style="margin-bottom: 100px" class="row ">
        <div class="col-12 col-md-3 text-center">
          <img src="/p4.png" alt="">
        </div>
        <div class="col-12 col-md-7 offset-0 offset-md-2">
          <h3 class="title q-mb-lg fs-36 ">04. Качество работы для нас превыше всего</h3>
          <p class="no-margin text-avenir-300">
          Мы работаем только с акварельной живописью в Digi Gravure – цифровая гравюра. DIGI – оцифровка оригинала. GRAVURE – оттиск на бумаге. Оборудование – CANON PRO – 6000 (12 – цветный принтер с минеральными пигментами высокой четкости музейного качества.
<br><br>
Пигмент- LUCIA PRO – светостойкие. Бумага 310 гр/м2, 100 % хлопок – CANSON. Покрытие спрей лаком LOREAL матовый люкс. Китайским партнерам больше подходит именно этот вариант, так как они не считают нужным страховать и нести ответственность за оригиналы.
<br><br>
Современная, цифровая, типографская техника с поразительной точностью копирует и переносит на бумагу не только цвет, но и фактуру красок, бумаги, холста.
          </p>
        </div>

      </div>




    </div>

<!--    <section  class="about bg-grey-2 q-mb-none q-pt-xl">-->
<!--      <div class="container">-->
<!--         <div class="row q-mb-xl">-->
<!--        <div class="col-12 col-md-6">-->
<!--          <q-img src="~assets/pp2-1.png"/>-->
<!--        </div>-->
<!--        <div class="col-12 col-md-6">-->
<!--          <q-img src="~assets/pp2-2.png"/>-->
<!--        </div>-->
<!--      </div>-->
<!--        <h3 class="title q-mb-lg ">NFT в искусстве</h3>-->

<!--        <div class="row q-col-gutter-md-xl items-start">-->
<!--          <div class=" col-12 col-md-6 q-mb-lg q-mb-md-none row-text">-->
<!--            <p class="text-lh-150">-->
<!--        ARTDOX.RU - первая компания, которая сделала NFT искусство Доходным.-->
<!-- Наша цель - заявить о себе на торговых площадках NFT и обеспечить нашим Клиентам достойный заработок.-->
<!--<br><br>-->
<!--Каждому покупателю наших NFT картин мы отправляем  оригинал произведения по тому адресу, который он укажет при заказе картины.-->
<!--Основной заработок на NFT-площадках происходит в момент перепродажи картин после проведения рекламной кампании.-->
<!--<br><br>-->
<!--Ваш доход зависит от длительности проведения рекламной кампании и  привязан к курсу криптовалюты ETH (Эфир).-->
<!--<br><br>-->
<!--Мы гарантируем прибыль от 18 до 34% прибыли в случае проведения “короткой” рекламной кампании и от 65 до 85% прибыли в случае проведения полноценной подготовки аудитории к нашим произведениям искусства.-->
<!--<br><br>-->
<!--Все картины выкладываются на ресурс и продвигаются нашей компанией в две волны за каждый период времени, параллельно друг с другом.</p>-->

<!--          </div>-->
<!--          <div class="col-12 col-md-6 row-img q-mb-lg q-mb-md-none">-->

<!--            <div class="col-12 text-center"><img class="img" style="width: 60%" src="~assets/nft-img.png" alt=""></div>-->



<!--          </div>-->
<!--        </div>-->

<!--      </div>-->
<!--    </section>-->
<!--      <section  class="about bg-grey-2 q-py-xl no-margin">-->
<!--      <div class="container">-->
<!--        <h3 class="title q-mb-lg fs-36">Маркетплейсы, где мы<br class="gt-sm">представлены</h3>-->
<!--        <p class="text-lh-150 q-mb-xl">-->
<!--          Кликните на логотип платформы, чтобы сразу перейти на страницу с<br class="gt-sm"> нашим верифицированным магазином </p>-->
<!--        <div class="row q-col-gutter-md-xl items-start">-->
<!--          <div class=" col-12 col-md-4 q-mb-md q-mb-md-none text-center">-->
<!--            <img class="img" src="~assets/p1.jpg" alt="">-->

<!--          </div>-->
<!--          <div class=" col-12 col-md-4 q-mb-md q-mb-md-none text-center">-->
<!--            <img class="img" src="~assets/p2.jpg" alt="">-->
<!--          </div>-->
<!--          <div class=" col-12 col-md-4   text-center">-->
<!--            <img class="img" src="~assets/p3.jpg" alt="">-->

<!--          </div>-->

<!--        </div>-->

<!--      </div>-->

<!--    </section>-->


  </q-page>
</template>
<script>


export default {
  data() {
    return {
      steps:
        [
          {img:'step1.png',text:'Регистриуретесь на сайте'},
          {img:'step1.png',text:'Выбираете картину или несколько из галерии'},
          {img:'step1.png',text:'Регистриуретесь на сайте'},
          {img:'step1.png',text:'Регистриуретесь на сайте'},
        ],
      items:[
        {text:`Для Китая формируем коллекции из 30 авторских репродукций, и через партнера ArtBooklet Ltd., размещаем их на экспозициях в провинциальных городах, с образовательной и просветительской целью.<br><br>

От китайской стороны стабильно получаем 10 Юаней (1,5 $) в сутки за каждую картину, из расчета 300 экспозиционных дней в году.<br><br>

Также открыты пункты продаж репродукций в этих местах. Необходимое количество экспозиций в год не менее 10 (300 картин), и эти потребности в Китае постоянно растут.<br><br>

В России сдаем в аренду авторские репродукции музейного качества по 30 рублей в сутки за каждую картину, в общеобразовательные, культурные и административные учреждения, меценаты активно участвуют в этом процессе.
`},
        {text:`Мы планируем создать свои Коллекции картин в формате NFT и продвинуть их на маркетплейсе Binance.  NFT, или "несменяемый токен" - это уникальный цифровой сертификат, который хранится в блокчейне и предоставляет определенные права собственности на актив, такой как цифровое произведение искусства.<br><br>

NFT предоставляют мощный инструмент для установления и демонстрации прав собственности в пространстве цифровых активов. "Чеканка" NFT относится к созданию NFT и его записи в блокчейне впервые. Чеканщик может быть создателем работы, связанной с NFT, например, художником, или кем-либо, имеющим соответствующие права на чеканку NFT цифрового актива.<br><br>

Каков потенциал NFT в мире искусства и на рынке искусства?
11 марта 2021 года Christie's продал первый NFT, основанный исключительно на цифровом произведении искусства, когда-либо предлагавшемся крупным аукционным домом, за 69 346 250 долларов США.
`},
        {text:`Все наши картины анонимные, мы заведомо не указываем авторов, чтобы авторитетом и перечнем заслуг не завышать цены на них. С каждым художником мы имеем соглашение на покупку оцифрованной картины, на общий тираж произведения (30 штук с каждого оригинала), печать, подпись и сертификат от художника подтверждает это.<br><br>

Репродукции картин сделаны на высочайшем уровне, с использованием наилучших, экологически чистых материалов. Наш покупатель получает одну репродукцию, остальные экземпляры отправляются управляющей компанией в разные регионы России и Китая, для обеспечения дохода.`},
        {text:`Мы работаем только с акварельной живописью в Digi Gravure – цифровая гравюра. DIGI – оцифровка оригинала. GRAVURE – оттиск на бумаге. Оборудование – CANON PRO – 6000 (12 – цветный принтер с минеральными пигментами высокой четкости музейного качества.
<br><br>
Пигмент- LUCIA PRO – светостойкие. Бумага 310 гр/м2, 100 % хлопок – CANSON. Покрытие спрей лаком LOREAL матовый люкс. Китайским партнерам больше подходит именно этот вариант, так как они не считают нужным страховать и нести ответственность за оригиналы.
<br><br>
Современная, цифровая, типографская техника с поразительной точностью копирует и переносит на бумагу не только цвет, но и фактуру красок, бумаги, холста.`},

      ]
    }
  }
}
</script>

<style lang="sass" scoped>
.profit

  &-inner
    max-width: 940px
    margin: 0 auto
  &-item
    display: grid

    padding: 30px 0
    border-bottom: 1px solid #E5E5E5
    grid-gap: 170px
    &:last-child
      border-bottom: none
@media (max-width: 1024px)
  .profit
    & .text-center
      font-size: 24px
      line-height: 28px
    &-wrapper
      margin: 0 -10px
      padding: 0 10px

  .text-b
    order: 2
  .img-b
    order: 1

.steps
  display: grid
  grid-template-columns: repeat(2, 1fr)
  grid-gap: 12px
  margin-bottom: 70px
.step
  background: $grey-2
  padding: 24px


</style>
